#4.2[24]: ¬ фермерском хоз€йстве в  арелии выращивают чернику. 
#ќна растет на круглой гр€дке, причем кусты высажены только по окружности. 
#“аким образом, у каждого куста есть ровно два соседних. ¬сего на гр€дке растет N кустов. 
#—обирающий модуль за один заход, наход€сь непосредственно перед некоторым кустом, 
#собирает €годы с этого куста и с двух соседних с ним.

#Ќапишите программу дл€ нахождени€ максимального числа €год, 
#которое может собрать за один заход собирающий модуль, наход€сь перед некоторым кустом. 
#Ќа входе задано количество €год на каждом кусте. Ќе об€зательно вводить их с клавиатуры, 
#можно задать непосредственно в коде программы

#ѕримеры/“есты:
#Input1: 1, 2, 3, 4, 5, 6, 7, 8
#Output1: ћакс. кол-во €год 21, собрано дл€ куста 7

#Input1: 11, 92, 1, 42, 15, 12, 11, 81
#Output1: ћакс. кол-во €год 184, собрано дл€ куста 1

